app/Http/Controllers/PostController.php

select * from `posts`
---
    public function index()
    {
        return view('blog.index', [
            'posts' => Post::all()
        ]);

insert into `posts` (`title`, `excerpt`, `body`, `min_to_read`, `image_path`, `is_published`, `id`, `updated_at`, `created_at`) values ('Es Krim Rebus', 'Cream di Rebus', 'Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim Rebusnya di es krim', '9', '{}', 0, '01gyw47jees6s59yddzf35dh9h', '2023-04-25 11:54:23', '2023-04-25 11:54:23')
---
    public function store(Request $request)
    {

        // $post = new Post();

        // $post->title = $request->title;
        // $post->excerpt = $request->excerpt;
        // $post->body = $request->body;
        // $post->min_to_read = $request->min_to_read;
        // $post->image_path = 'unavailable';
        // $post->is_published = $request->is_published === 'on';

        // $post->save();

        $request->validate([
            'title' => 'required|unique:posts|max:255',
            'excerpt' => 'required',
            'body' => 'required',
            'min_to_read' => 'required|min:0|max:60',
            'image' => 'required|mimes:ppg,jng,jpeg'
        ]);

        Post::create([
            'title' => $request->title,
            'excerpt' => $request->excerpt,
            'body' => $request->body,
            'min_to_read' => $request->min_to_read,
            'image_path' => $this->storeFile($request),
            'is_published' => $request->is_published === 'on',
        ]);

select * from `posts` where `posts`.`id` = '01gyvn308gsjyxtxw815ggv2vv' limit 1
---
    public function show(string $id)
    {
        return view('blog.show', [
            'post' => Post::findOrFail($id)
        ]);

select * from `posts` where `id` = '01gyvn308n3xb0msn8we3xa7kr' limit 1
---
    public function edit(string $id)
    {
        return view('blog.edit', [
            'post' => Post::where('id', $id)->first(),
        ]);

update `posts` set `title` = 'Kembang Api', `excerpt` = 'Api nya dikembangin lagi', `min_to_read` = '12', `body` = 'Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api Perkembangan Api', `posts`.`updated_at` = '2023-04-25 13:53:49' where `id` = '01gyvn308mgdvvq6511dh07k6b'
---
    public function update(Request $request, string $id)
    {
        $request->validate([
            'title' => 'required|max:255|unique:posts,title,' . $id,
            'excerpt' => 'required',
            'body' => 'required',
            'min_to_read' => 'required|min:0|max:60',
            'image' => 'mimes:ppg,jng,jpeg'
        ]);

        Post::where('id', $id)->update($request->except([
            '_token', '_method'
        ]));

delete from `posts` where `id` = '01gyvn309103bvns93dgt1afaa'
---
    public function destroy(string $id)
    {
        Post::destroy($id);